In [1]:
import numpy as np
import pandas as pd

In [2]:
grades = {"melike": 100, "rümeysa": 90, "elif": 45}

In [3]:
pd.Series(grades)

melike     100
rümeysa     90
elif        45
dtype: int64

In [17]:
data = np.random.randn(4,3)

In [18]:
data

array([[ 1.31012105, -0.55523933, -0.35671721],
       [ 1.07669555, -0.30838391,  0.02690117],
       [-0.37739722,  1.38525708,  0.10481076],
       [ 1.28738969,  0.90835137, -0.33285913]])

In [19]:
data_frame = pd.DataFrame(data)

In [20]:
data_frame

          0         1         2
0  1.310121 -0.555239 -0.356717
1  1.076696 -0.308384  0.026901
2 -0.377397  1.385257  0.104811
3  1.287390  0.908351 -0.332859

In [21]:
type(data_frame)

pandas.core.frame.DataFrame

In [22]:
data_frame[0]

0    1.310121
1    1.076696
2   -0.377397
3    1.287390
Name: 0, dtype: float64

In [23]:
type(data_frame[0])

pandas.core.series.Series

In [24]:
new_df = pd.DataFrame(data, index=['a','b','c','d'], columns=['salary','age','seniority'])

In [25]:
new_df

     salary       age  seniority
a  1.310121 -0.555239  -0.356717
b  1.076696 -0.308384   0.026901
c -0.377397  1.385257   0.104811
d  1.287390  0.908351  -0.332859

In [26]:
new_df['salary']

a    1.310121
b    1.076696
c   -0.377397
d    1.287390
Name: salary, dtype: float64

In [27]:
new_df[['salary','age']]

     salary       age
a  1.310121 -0.555239
b  1.076696 -0.308384
c -0.377397  1.385257
d  1.287390  0.908351

In [28]:
new_df.loc['a']

salary       1.310121
age         -0.555239
seniority   -0.356717
Name: a, dtype: float64

In [29]:
new_df.iloc[1]

salary       1.076696
age         -0.308384
seniority    0.026901
Name: b, dtype: float64

In [30]:
new_df.iloc[:,1]

a   -0.555239
b   -0.308384
c    1.385257
d    0.908351
Name: age, dtype: float64

In [31]:
new_df["Extra"]=10

In [32]:
new_df

     salary       age  seniority  Extra
a  1.310121 -0.555239  -0.356717     10
b  1.076696 -0.308384   0.026901     10
c -0.377397  1.385257   0.104811     10
d  1.287390  0.908351  -0.332859     10

In [36]:
new_df.drop("Extra",axis=1)  # kaldırılmış haliyle yeni bir df oluşturuyor. bu yüzden newdf i çağırdığımda kaldırılmadığını görürüm

     salary       age  seniority
a  1.310121 -0.555239  -0.356717
b  1.076696 -0.308384   0.026901
c -0.377397  1.385257   0.104811
d  1.287390  0.908351  -0.332859

In [37]:
new_df

     salary       age  seniority  Extra
a  1.310121 -0.555239  -0.356717     10
b  1.076696 -0.308384   0.026901     10
c -0.377397  1.385257   0.104811     10
d  1.287390  0.908351  -0.332859     10

In [38]:
new_df.drop("Extra", axis=1, inplace=True) # inplace df in içinde drop yap demektir

In [40]:
new_df

     salary       age  seniority
a  1.310121 -0.555239  -0.356717
b  1.076696 -0.308384   0.026901
c -0.377397  1.385257   0.104811
d  1.287390  0.908351  -0.332859

In [41]:
new_df.loc['a']

salary       1.310121
age         -0.555239
seniority   -0.356717
Name: a, dtype: float64

In [42]:
new_df.loc['a']['age']

np.float64(-0.5552393330348262)

In [43]:
new_df.loc['a','age']=30

In [44]:
new_df

     salary        age  seniority
a  1.310121  30.000000  -0.356717
b  1.076696  -0.308384   0.026901
c -0.377397   1.385257   0.104811
d  1.287390   0.908351  -0.332859

In [45]:
new_df>0

   salary    age  seniority
a    True   True      False
b    True  False       True
c   False   True       True
d    True   True      False

In [46]:
new_df[new_df>0]

     salary        age  seniority
a  1.310121  30.000000        NaN
b  1.076696        NaN   0.026901
c       NaN   1.385257   0.104811
d  1.287390   0.908351        NaN

In [48]:
new_df[new_df['age']>1]

     salary        age  seniority
a  1.310121  30.000000  -0.356717
c -0.377397   1.385257   0.104811

In [49]:
# index

In [51]:
reset_frame = new_df.reset_index()

In [73]:
reset_frame

  index    salary        age  seniority
0     a  1.310121  30.000000  -0.356717
1     b  1.076696  -0.308384   0.026901
2     c -0.377397   1.385257   0.104811
3     d  1.287390   0.908351  -0.332859

In [79]:
reset_frame.loc[0]

index               a
salary       1.310121
age              30.0
seniority   -0.356717
Name: 0, dtype: object

In [80]:
new_df["NewIndex"]=["q","w","e","r"]

In [81]:
new_df

                age  seniority NewIndex
NewIndex
q         30.000000  -0.356717        q
w         -0.308384   0.026901        w
e          1.385257   0.104811        e
r          0.908351  -0.332859        r

In [84]:
new_df.set_index("NewIndex", inplace=True) # verdiğin sütunu index sütunu olarak ayarla

In [85]:
new_df

                age  seniority
NewIndex
q         30.000000  -0.356717
w         -0.308384   0.026901
e          1.385257   0.104811
r          0.908351  -0.332859

In [86]:
# multi index

In [87]:
first_index = ["Friends", "Friends", "Friends", "Himym", "Himym", "Himym"]

In [88]:
inner_index = ["Monica", "Chandler", "Joey", "Ted", "Barney", "Lily"]

In [89]:
zipped_index = list(zip(first_index, inner_index))

In [90]:
zipped_index

[('Friends', 'Monica'),
 ('Friends', 'Chandler'),
 ('Friends', 'Joey'),
 ('Himym', 'Ted'),
 ('Himym', 'Barney'),
 ('Himym', 'Lily')]

In [91]:
zipped_index = pd.MultiIndex.from_tuples(zipped_index)

In [92]:
zipped_index

MultiIndex([('Friends',   'Monica'),
            ('Friends', 'Chandler'),
            ('Friends',     'Joey'),
            (  'Himym',      'Ted'),
            (  'Himym',   'Barney'),
            (  'Himym',     'Lily')],
           )

In [95]:
sample_values = np.ones((6,2))

In [99]:
big_df = pd.DataFrame(sample_values, index=zipped_index, columns=["Age", "Salary"])

In [100]:
big_df

                  Age  Salary
Friends Monica    1.0     1.0
        Chandler  1.0     1.0
        Joey      1.0     1.0
Himym   Ted       1.0     1.0
        Barney    1.0     1.0
        Lily      1.0     1.0

In [101]:
big_df["Age"]

Friends  Monica      1.0
         Chandler    1.0
         Joey        1.0
Himym    Ted         1.0
         Barney      1.0
         Lily        1.0
Name: Age, dtype: float64

In [104]:
big_df.loc["Friends"].loc["Monica"]

Age       1.0
Salary    1.0
Name: Monica, dtype: float64